:PROPERTIES:
:ID:       3b5a8d8e-5a48-44c4-aa4f-29761ebd2067
:END:
#+title: Vector Spaces
* Definitions

1) u + v exists in V
2) u + v = v + u
3) (u + v) + w = u + ( v + w )
4) 0 exists in V, ie u + 0 = 0
5) 
6) cu exists in V
7) c(u + v) = cu + cv
8) (c + d)u = cu + cv
9) c(du) = (cd)u
10) Iu = u



#+begin_src octave :results output

  format rat

    M = [1 5 -2 ; 1/3 -1 4 ; 6 7 3/8]

  A = [1 1/5 -1/2 ; 3 -1 1/4 ; 1/6 1/7 3/8]






#+end_src

#+RESULTS:
#+begin_example
M =

          1          5         -2
        1/3         -1          4
          6          7        3/8

A =

          1        1/5       -1/2
          3         -1        1/4
        1/6        1/7        3/8

M =

          0          0          0
          0          0          0
          0          0          0

#+end_example


#+begin_src octave

  c = 1;
  A = [1 2 3 ; 4 5 6 ; 1 2 3];



  B = [0 1 3 ; 4 1 1 ; 0 1 0];
  LHS = [1 3 10 ; 17 6 7 ; 1 3 1];

  RHS = [2 6 16 ; 25 12 14 ; 2 6 4];


#+end_src

#+begin_src octave

           c = 1
          d = 0

        A = [1 2 1 ; 2 1 2 ; 0 2 2];
      



    LHS = [2 3 2 ; 3 2 3 ; 1 3 3];


    RHS = [2 6 2 ; 6 2 6 ; 0 6 6];

#+end_src

